src/test/jmeter/RedisBasicTests.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="RedisBasicTests" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1348465937000</longProp>
        <longProp name="ThreadGroup.end_time">1348465937000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SplineVisualizer" testclass="ResultCollector" testname="Spline Visualizer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <RandomOrderController guiclass="RandomOrderControllerGui" testclass="RandomOrderController" testname="Random Order Controller" enabled="true"/>
        <hashTree>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testGetSet" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisBasicTest</stringProp>
            <stringProp name="junitsampler.method">testGetSet</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testStrlen" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisBasicTest</stringProp>
            <stringProp name="junitsampler.method">testStrlen</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testStrlenDoesNOTExists" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisBasicTest</stringProp>
            <stringProp name="junitsampler.method">testStrlenKeyDoesNotExists</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testIncr" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisBasicTest</stringProp>
            <stringProp name="junitsampler.method">testIncr</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testIncrBy" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisBasicTest</stringProp>
            <stringProp name="junitsampler.method">testIncrBy</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testZAddUpdate" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisSortedSetTest</stringProp>
            <stringProp name="junitsampler.method">testZAddUpdate</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testZRange" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisSortedSetTest</stringProp>
            <stringProp name="junitsampler.method">testZRange</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testZRevRange" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisSortedSetTest</stringProp>
            <stringProp name="junitsampler.method">testZRevRange</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
          <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="testZScoreAndIncr" enabled="true">
            <stringProp name="junitSampler.classname">cz.redis.jedis.JedisRedisSortedSetTest</stringProp>
            <stringProp name="junitsampler.method">testZScoreAndIncr</stringProp>
            <stringProp name="junitsampler.success">Test successful</stringProp>
            <stringProp name="junitsampler.success.code">1000</stringProp>
            <stringProp name="junitsampler.failure">Test failed</stringProp>
            <stringProp name="junitsampler.failure.code">0001</stringProp>
            <stringProp name="junitsampler.error">An unexpected error occured</stringProp>
            <stringProp name="junitsampler.error.code">9999</stringProp>
            <stringProp name="junitsampler.exec.setup">false</stringProp>
            <stringProp name="junitsampler.append.error">true</stringProp>
            <stringProp name="junitsampler.append.exception">true</stringProp>
            <boolProp name="junitsampler.junit4">true</boolProp>
            <boolProp name="junitsampler.createinstancepersample">true</boolProp>
          </JUnitSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>